app/models/event.rb


  private def schedule_order
  	return if start_date.blank?
    for e in Event.all do
---
SELECT "events".* FROM "events"